###############################################################################
# Created by write_sdc
# Fri Jul 17 05:23:59 2026
###############################################################################
current_design UART
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {div[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {div[10]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {div[11]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {div[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {div[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {div[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {div[4]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {div[5]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {div[6]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {div[7]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {div[8]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {div[9]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {parityEnable}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {parityType}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_data_valid}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_in[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_in[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_in[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_in[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_in[4]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_in[5]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_in[6]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_in[7]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {framingError}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {parityError}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {parityErrorValid}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_busy}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_done}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_out[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_out[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_out[2]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_out[3]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_out[4]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_out[5]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_out[6]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_out[7]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_busy}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_done}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {framingError}]
set_load -pin_load 0.0334 [get_ports {parityError}]
set_load -pin_load 0.0334 [get_ports {parityErrorValid}]
set_load -pin_load 0.0334 [get_ports {rx_busy}]
set_load -pin_load 0.0334 [get_ports {rx_done}]
set_load -pin_load 0.0334 [get_ports {tx}]
set_load -pin_load 0.0334 [get_ports {tx_busy}]
set_load -pin_load 0.0334 [get_ports {tx_done}]
set_load -pin_load 0.0334 [get_ports {rx_out[7]}]
set_load -pin_load 0.0334 [get_ports {rx_out[6]}]
set_load -pin_load 0.0334 [get_ports {rx_out[5]}]
set_load -pin_load 0.0334 [get_ports {rx_out[4]}]
set_load -pin_load 0.0334 [get_ports {rx_out[3]}]
set_load -pin_load 0.0334 [get_ports {rx_out[2]}]
set_load -pin_load 0.0334 [get_ports {rx_out[1]}]
set_load -pin_load 0.0334 [get_ports {rx_out[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {parityEnable}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {parityType}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tx_data_valid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {div[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tx_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tx_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tx_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tx_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tx_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tx_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tx_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tx_in[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 8.0000 [current_design]
